src/InformationRegisters/ИсторияПримененияКонфигураций/ИсторияПримененияКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПримененияКонфигураций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Коммит</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещениеОтправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Хранилище</name>
    <type>
      <types>CatalogRef.Хранилища</types>
    </type>
  </dimensions>
  <dimensions>
    <name>База1С</name>
    <type>
      <types>CatalogRef.Базы1С</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ПредопределенныеЭлементыОбъектовМетаданных/ПредопределенныеЭлементыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПредопределенныеЭлементыОбъектовМетаданных</name>
  <owners>Catalog.ОбъектыМетаданных</owners>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяГруппой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ПредопределенныеЭлементыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/WebServices/Automacon/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция GetCurrentState()
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров)
	
	ТЗ = ВнешниеДанные.ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров);
	Возврат XMLСтрока(Новый ХранилищеЗначения(ТЗ));
	
КонецФункции

Функция ЗарегистрироватьОбновлениеИБ(Хранилище, НомерКоммита, База1С, Комментарий, Ответственный)
	
	Возврат РегистрыСведений.ИсторияПримененияКонфигураций.ЗарегистрироватьОбновлениеИБ(Хранилище, НомерКоммита, База1С, Комментарий, Ответственный);
	
КонецФункции

Функция ПолучитьСписокПредопределенныхЭлементов(КонфигурацияИдентификатор)
	
	СтруктураПараметров = Новый Структура("КонфигурацияИдентификатор", КонфигурацияИдентификатор);
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Спр.Владелец.Наименование КАК ОбъектМетаданных,
		|	Спр.УИД КАК УИД,
		|	Спр.Наименование КАК ИмяПредопределенного,
		|	Спр.Синоним КАК Синоним,
		|	Спр.КодЭлемента КАК Код,
		|	Спр.ЯвляетсяГруппой КАК ЭтоГруппа,
		|	Спр.Группа.УИД КАК РодительУИД
		|ИЗ
		|	Справочник.ПредопределенныеЭлементыОбъектовМетаданных КАК Спр
		|ГДЕ
		|	Спр.Владелец.Владелец.Идентификатор = &КонфигурацияИдентификатор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектМетаданных,
		|	ЭтоГруппа УБЫВ,
		|	Код";
	Возврат ПолучитьРезультатЗапроса(ТекстЗапроса, СтруктураПараметров);
	
КонецФункции

#КонецОбласти
